Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་བདེན་པའི་བྱིན་གྱིས་བརླབས་བྱེད་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ལ་ནི་བདུད་ཀྱི་ལས་ཆུང་ལ། ལས་ཀྱི་སྒྲིབ་པ་ཤས་ཆེ་བ་ཡིན་པས། དེས་ནི་ཡུལ་མང་པོ་ལ་ངེས་པར་བརྟག་པར་བྱ་ཞིང་། ཏིང་ངེ་འཛིན་བསྒྲུབ་པ་ལ་མཁས་པར་ཡང་བྱ། སྤྱོད་ལམ་དྲང་པོ་དང་། སོགས་པ་དང་བྲལ་བར་ཡང་བྱའོ། །
en: 75. “Vajrapramardin, if in a dream bodhisattvas perceive themselves performing an act of truth, consider those bodhisattva to be on any of the ten bhūmis. For such bodhisattvas the influence of Māra is slight and karmic obscurations dominate. They should investigate many topics, become learned in practicing samādhi, be upright in their behavior, and avoid excess.

source: གང་སྦྱིན་པ་དང་ལྡན་པའི་བྱིན་གྱིས་བརླབས་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas perform an act of truth involving generosity, consider such bodhisattvas to be on the first bhūmi.

source: བཅིངས་པ་ལས་ཐར་བར་བྱ་བའི་ཕྱིར་ན་ས་གཉིས་པར་བལྟའོ། །
en: If they do so in order to liberate beings from bondage, consider them to be on the second bhūmi.

source: ནད་པ་ཐར་བར་བྱ་བའི་ཕྱིར་ན་ས་གསུམ་པར་བལྟའོ། །
en: If they do so in order to liberate beings from illness, consider them to be on the third bhūmi.

source: གྲོང་ཁྱེར་གྱི་ཕྱིར་ན་ས་བཞི་པར་བལྟའོ། །
en: If they do so for the sake of a city, consider them to be on the fourth bhūmi.

source: རྒྱལ་པོའི་ཕྱིར་ན་ས་ལྔ་པར་རོ། །
en: If they do so for the sake of a king, they are on the fifth bhūmi.

source: གླིང་བཞི་པའི་ཕྱིར་ན་ས་དྲུག་པར་རོ། །
en: If they do so for the sake of the four continents, they are on the sixth bhūmi.

source: སྟོང་གི་ཕྱིར་ན་ས་བདུན་པར་རོ། །
en: If they so for the sake of a chiliocosm, they are on the seventh bhūmi.

source: སྟོང་གཉིས་པའི་ཕྱིར་ན་ས་བརྒྱད་པར་རོ། །
en: If they do so for the sake of a dichiliocosm, they are on the eighth bhūmi.

source: སྟོང་གསུམ་པའི་ཕྱིར་ན་ས་དགུ་པར་རོ། །
en: If they do so for the sake of a trichiliocosm, they are on the ninth bhūmi.

source: འོད་འབྱུང་བ་དང་། ས་གཡོ་བ་དང་། ལྷ་རྣམས་ཀྱིས་མེ་ཏོག་གི་ཆར་དབབ་པའི་ཕྱིར་ན་ས་བཅུ་པར་ཏེ།
en: If they do so in order to emit light, cause an earthquake, or elicit a rain of flowers from the gods, they are on the tenth bhūmi.

source: ས་དྲུག་པོ་དག་ལ་ནི་བདུད་ཀྱི་ལས་མ་གཏོགས་སོ། །
en: From the first to the sixth bhūmis, these signs could be the activity of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་འབྲས་བུའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 76. “Vajrapramardin, if in a dream bodhisattvas see a fruit tree, consider those bodhisattvas to be on one of the first seven bhūmis.

source: ལུང་བསྟན་པ་ཡོངས་སུ་རྫོགས་པའི་ཆོས་དང་ལྡན་པ་ཡིན་ནོ། །
en: They have perfected the qualities for receiving a prediction.

source: དེས་ནི་རྙེད་པ་དང་བཀུར་སྟི་ལ་མ་ཆགས་པ་དང་། དྲང་པོ་དང་ཉེས་པ་མི་འཛིན་པར་བྱའོ། །
en: Such bodhisattvas should have no attachment to profit and honor, and not cling to integrity or flaws.

source: གང་གིས་འབྲས་བུ་ཉུང་ངུའི་ཤིང་ལྗོན་པ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see a tree with little fruit, consider them to be on the first bhūmi.

source: གང་གིས་འབྲས་བུ་མང་པོའི་ཤིང་ལྗོན་པ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see a tree with abundant fruit, consider them to be on the second bhūmi.

source: གང་གིས་འབྲས་བུ་རོ་ཞིམ་པོའི་ཤིང་ལྗོན་པ་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see a tree with delicious fruit, consider them to be on the third bhūmi.

source: གང་གིས་འབྲས་བུ་དྲི་ཞིམ་པོའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see a tree with fragrant fruit, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་འབྲས་བུ་སྨན་དུ་རུང་བའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see a tree with medicinal fruit, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་ལྷ་ཡུལ་པ་ལྟ་བུའི་འབྲས་བུའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see a tree with fruit like those in the god realms, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་གིས་བདུད་རྩིའི་རོ་དང་ལྡན་པའི་འབྲས་བུའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see a tree with fruit that tastes like the nectar of immortality, consider those bodhisattvas to be on the seventh bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 77. “Vajrapramardin, if in a dream bodhisattvas see a flowering tree, consider those bodhisattvas to be on one of the first seven bhūmis.

source: དེས་ནི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་བྱ་བ་ལ་བརྩོན་པར་བྱ་ཞིང་དགེ་བའི་རྩ་བའི་ཆོས་དེ་ལ་ཀུན་ཏུ་སྤྱོད་པ་ན་དེས་འཁོར་བཞི་པོ་དག་དང་མ་འདྲེས་པར་རི་ཁྲོད་དུ་འགྲོ་བ་ལ་བརྩོན་པར་བྱའོ། །
en: They should endeavor to create a variety of virtuous roots. If they cultivate the qualities of the virtuous roots, they should not mix with the fourfold community but seek out solitude.

source: གང་གིས་མེ་ཏོག་མང་ལ་དྲི་མི་ཞིམ་པའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see a tree with many foul-smelling flowers, consider them to be on the first bhūmi.

source: གང་གིས་མེ་ཏོག་དྲི་ཞིམ་པོའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see a tree with fragrant flowers, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་མེ་ཏོག་མང་ཞིང་དྲི་ཞིམ་པའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see a tree with many fragrant flowers, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་མེ་ཏོག་དང་འབྲས་བུར་བཅས་པའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see a tree that bears both flowers and fruit, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་ལོ་མ་ཉུང་བའི་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see a flowering tree with few leaves, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་ལྷའི་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they a tree with divine flowers, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟ་སྟེ།
en: If they see a Bodhi tree, consider those bodhisattvas to be on the seventh bhūmi.

source: ས་གོང་མ་དག་ལ་ནི་མཚན་མ་ལྡོག་པ་མེད་དོ། །
en: On higher bhūmis the signs are incontrovertible.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་གྲོང་ཁྱེར་མཐོང་ན་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དེ་དག་ཏུ་བལྟ་སྟེ།
en: 78. “Vajrapramardin, if in a dream bodhisattvas see a city they have never seen before, consider those bodhisattvas to be on one of the first six bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་ཆོས་ཀྱི་སྒྲིབ་པ་མེད་དོ། །
en: Such bodhisattvas have no Dharma obscurations.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ཉེ་བར་རིག་པར་བྱ་སྟེ།
en: Recognize that those bodhisattvas are close to the acceptance that phenomena do not arise.

source: དེས་ནི་སྟོང་པ་ཉིད་བསྒོམ་པའི་ཕྱིར་ཡི་དམ་ལ་བརྟན་པ་དང་། བདེ་བ་དང་སྡུག་བསྔལ་དག་གིས་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱའོ། །
en: They should focus their attention on cultivating emptiness, and develop an attitude that is unaffected by happiness and suffering.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། །བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their related karmic obscurations will be purified and they will find release in awakening.

source: གྲོང་ཁྱེར་དང་པོ་བརྩིགས་མ་ཐག་པ་མཐོང་ན་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see a city that has just been built, consider them to be on the first bhūmi.

source: གྲོང་ཁྱེར་ཕྱིས་བྱི་དོར་བྱས་པ་མཐོང་ན་ས་གཉིས་པར་རོ། །
en: If they see a city that has been swept clean, they are on the second bhūmi.

source: ར་བ་ཕུན་སུམ་ཚོགས་པས་ནི་ས་གསུམ་པར་རོ། །
en: If they see a city with a magnificent wall, they are on the third bhūmi.

source: སྐྱེད་མོས་ཚལ་ཕུན་སུམ་ཚོགས་པས་ནི་ས་བཞི་པར་རོ། །
en: If they see one with magnificent parks, they are on the fourth bhūmi.

source: འབབ་ཆུ་ཕུན་སུམ་ཚོགས་པས་ནི་ས་ལྔ་པར་རོ། །
en: If they see one with magnificent waterways, they are on the fifth bhūmi.

source: རྫིང་བུ་ཕུན་སུམ་ཚོགས་པས་ནི་ས་དྲུག་པར་ཏེ།
en: If they see one with magnificent ponds, they are on the sixth bhūmi.

source: སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་སོང་བ་དང་། དམིགས་པ་ཅན་དང་། མངོན་པར་མི་བརྩོན་པ་དང་། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །
en: These are the signs apart from those caused by being under the guidance of evil companions, having conceptual fixation, and not being industrious, or that are the activity of Māra.

source: ས་གོང་མ་དག་ལ་ནི་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་མཐོང་ངོ་། །
en: Those on higher bhūmis will see all manner of magnificence.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མཚོ་མ་དྲོས་པ་མཐོང་ན་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 79. “Vajrapramardin, if in a dream bodhisattvas see Lake Anavatapta, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེ་ལ་ཉོན་མོངས་པ་ནི་ཆུང་ངོ་། །གལ་ཏེ་ལྷག་པའི་བསམ་པས་བརྩོན་པར་བྱེད་ཅིང་ལུས་དང་། སྲོག་དང་། ཡོ་བྱད་དག་ལ་ལྷག་པར་ཆགས་པར་མི་བྱེད་ན་དེ་ལ་མྱུར་དུ་སྣང་བ་སྐྱེ་བར་འགྱུར་རོ། །
en: They have few afflictions, and if they exert themselves in combination with a pure motivation and avoid attachment to their body, life, and possessions, they will quickly develop illumination.

source: དེས་གཞན་གྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་མངོན་པར་བརྩོན་པར་བྱ་སྟེ།
en: They should strive to fulfill the aspirations of others.

source: གང་གིས་མཚོ་མ་དྲོས་པའི་འགྲམ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see Lake Anavatapta’s shore, consider them to be on the first bhūmi.

source: གང་གིས་དབུས་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they see its center, they are on the second bhūmi.

source: གང་གིས་ཐམས་ཅད་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they see all of it, they are on the third bhūmi.

source: གང་གིས་ལག་པས་རེག་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they touch it with their hand, they are on the fourth bhūmi.

source: གང་གིས་ཁྲུས་བྱས་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they bathe in it, they are on the fifth bhūmi.

source: གང་འགྲམ་ན་འདུག་ན་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they are sitting on the shore, they are on the sixth bhūmi.

source: གང་གིས་མཚོ་མ་དྲོས་པའི་ཀླུ་མཐོང་ན་དེ་ནི་ས་བདུན་པར་རོ། །
en: If they see the nāgas of Lake Anavatapta, they are on the seventh bhūmi.

source: གང་གིས་གནས་དང་གཟི་བྱིན་སྦྱིན་པར་མཐོང་ན་དེ་ནི་ས་བརྒྱད་པར་རོ། །
en: If they see it as a sacred place that bestows spiritual vitality, they are on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ལྷའི་བུ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: 80. “Vajrapramardin, if in a dream bodhisattvas see a god, consider those bodhisattvas to be on one of the first five bhūmis.

source: དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་དང་བདུད་ཀྱི་ལས་ནི་ཆུང་ལ་འདོད་པ་ཙམ་ནི་ཡོད་དེ།
en: Such bodhisattvas have few karmic obscurations and are minimally affected by the activities of Māra; they just experience attachment.

source: དེས་ཟླ་བ་གསུམ་དུ་བརྩོན་པར་བྱས་ན་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་།
en: If they make an effort for three months, their karmic obscurations will be purified.

source: རྣམ་པར་མ་དག་པ་ཡང་ཆུང་ངུར་འགྱུར་ལ་སྣང་བ་ཐོབ་པར་ཡང་འགྱུར་རོ། །
en: Even if they are not purified, they will become fewer, and those bodhisattvas will attain illumination.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསམས་པ་ཡིན་ཏེ།
en: They will be thought of by other bodhisattvas in the ten directions.

source: དེ་གལ་ཏེ་སྐྱོ་བར་མི་འགྱུར་ཞིང་མངོན་པར་བརྩོན་པར་འགྱུར་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: If those bodhisattvas do not become discouraged and are industrious, their related karmic obscurations will be purified and they will find release in awakening.

source: དེ་ལ་རྒྱལ་ཆེན་བཞི་པའི་རིས་ཀྱི་ལྷའི་བུ་མཐོང་ན་ས་དྲུག་པོ་དག་ཏུའོ། །
en: “If those bodhisattvas see a god from the Heaven of the Four Great Kings, they are on the first six bhūmis.

source: སུམ་ཅུ་རྩ་གསུམ་པས་ནི་ས་བདུན་པར་རོ། །
en: A god from the Heaven of the Thirty-Three indicates the seventh bhūmi.

source: དགའ་ལྡན་པས་ནི་ས་བརྒྱད་པར་རོ། །
en: A god from Tuṣita indicates the eighth bhūmi.

source: ཚངས་རིས་པས་ནི་ས་དགུ་པར་རོ། །
en: A god from the Brahmā Realm indicates the ninth bhūmi.

source: གནས་གཙང་མ་བས་ནི་ས་བཅུ་པར་རོ། །
en: A god from the Pure Abodes indicates the tenth bhūmi.

source: ས་དང་པོ་ལ་མངོན་པར་བརྩོན་པས་ནི་ས་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ། བདུད་ཀྱི་ལས་ཀྱང་ཡོད་དོ། །
en: Those who are industrious on the first bhūmi will see the signs of all of the bhūmis, but these signs may also be the activity of Māra.

source: ས་བཅུ་པོ་དག་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པས་ནི་ཐམས་ཅད་མཐོང་ངོ་། །
en: Those on the tenth bhūmi will see all of these signs because of their pure motivation.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཀླུ་མཐོང་ན་དེ་ནི་ས་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 81. “Vajrapramardin, if in a dream bodhisattvas see a nāga, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེ་ནི་ཆོས་ལ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: They have patience that accords with the Dharma.

source: དེ་ནི་བརྩམས་ནས་ཡང་ཕྱིར་རྣམ་པར་རྩེ་བར་འགྱུར་བ་དང་།
en: What they begin earnestly later turns into frivolity, efforts they take up are later abandoned, and their hedonism leads them to denigrate Dharma teachers.

source: སྦྱོར་བ་བཟུང་ནས་ཀྱང་ཡང་ཕྱིར་སྤོང་བར་འགྱུར་ཏེ། དེས་ནི་ལོངས་སྤྱོད་ཀྱི་གཞི་ལས་ཆོས་སྨྲ་བ་ལ་སྐུར་པ་བཏབ་པ་ཡིན་པས་དེས་སྡུག་པའི་དངོས་པོ་ཡོངས་སུ་བཏང་བ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: For this reason, they should be industrious in forsaking all their beloved possessions.

source: གང་གིས་རི་ལ་གནས་པའི་ཀླུ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see a nāga that lives on a mountain, consider them to be on the first bhūmi.

source: གང་གིས་ནགས་ཁུང་ན་གནས་པ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see one living in the deep wilderness, consider them to be on the second bhūmi.

source: གང་གིས་ཆུ་ཀླུང་གི་ཕ་རོལ་ཏུ་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see one on the far bank of a river, consider them to be on the third bhūmi.

source: གང་གིས་ནགས་ཁྲོད་ཏུ་མཐོང་ན་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see one in a forest, consider them to be on the fourth bhūmi.

source: གང་གིས་སྐྱེ་བོའི་ནང་དུ་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see one among people, consider them to be on the fifth bhūmi.

source: གང་གིས་རྒྱལ་པོའི་ཕོ་བྲང་གི་ནང་དུ་མཐོང་ན་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see one in a royal palace, consider them to be on the sixth bhūmi.

source: གང་གིས་སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see one surrounded by many people, consider them to be on the seventh bhūmi.

source: གང་གིས་ནམ་མཁའ་ལ་མཐོང་ན་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see one in the sky, consider them to be on the eighth bhūmi.

source: ས་དང་པོ་དྲུག་པོ་དག་ལ་ནི་བདུད་ཀྱི་ལས་མ་གཏོགས་པར་བལྟའོ། །
en: On the first to the sixth bhūmi, these signs might be the activity of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན། བདག་འཛམ་བུའི་གླིང་གཞན་དུ་སོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 82. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be traveling to another Jambudvīpa, consider those bodhisattvas to be on one of the first six bhūmis.

source: བཟོད་པ་ཐོབ་པ་ཡིན་ནོ། །
en: They have attained acceptance.

source: དེ་ལ་སྒྲིབ་པ་ནི་ཆུང་ན་དེ་མངོན་པར་མི་བརྩོན་པ་དང་། ལེ་ལོ་དང་གཡོ་ལ་སྟེན་པ་དང་།
en: If they have few obscurations, it means they are not industrious, are lazy, surrender to distraction, and have the pride of believing they are an ‘I.’

source: ངའོ་སྙམ་པའི་ང་རྒྱལ་གྱི་ཚུལ་གྱིས་སྣང་བ་ཐོབ་པར་མི་འགྱུར་བས་དེས་ཚུལ་དེ་དག་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རབ་ཏུ་བརྩོན་པར་བྱའོ། །
en: Given these tendencies, they will not attain illumination, and thus should make an effort to behave properly concerning these tendencies.

source: གང་གིས་འཛམ་བུའི་གླིང་ཉམས་མི་དགའ་བ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་རོ། །
en: “If those bodhisattvas see a Jambudvīpa that is unpleasant, they are on the first bhūmi.

source: གང་གིས་ཉམས་དགའ་བ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they see one that is pleasant, they are on the second bhūmi.

source: གང་གིས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་མཛེས་པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they see one with beautiful villages, cities, and towns, they are on the third bhūmi.

source: གང་གིས་སྐྱེད་མོས་ཚལ་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པར་མཐོང་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they see one with pleasure gardens bursting with flowers, they are on the fourth bhūmi.

source: གང་གིས་ལྗོངས་ཀྱི་མི་འདུས་པར་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they see one in which the region’s people are gathered together, they are on the fifth bhūmi.

source: གང་གིས་ཀུན་དགའི་ར་བ་དང་། ཚལ་ཕུན་སུམ་ཚོགས་པ་མཐོང་ན་དེ་ནི་ས་དྲུག་པར་ཏེ། །
en: If they see one with magnificent parks and groves, they are on the sixth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གོས་དཀར་པོ་གྱོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves wearing white clothes, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ལ་བདུད་ཀྱི་ལས་ཤས་ཆེ་བ་ཡིན་པས་དེ་ཆོས་ལ་འདུན་པ་སྐྱེས་ཀྱང་།
en: They have purified their karmic obscurations but are still predominantly affected by the activity of Māra.

source: ཡང་ཕྱིར་ནུར་བར་འགྱུར་ཞིང་དེའི་ཡོན་ཏན་དག་ལ་བར་ཆད་མང་བར་འགྱུར་བས་དངོས་པོ་ཐམས་ཅད་མི་སྦ་བར་བྱ་ཞིང་ཡེ་ཤེས་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, even though they have developed sincere interest in the Dharma, it eventually changes, and they experience numerous obstacles to acquiring good qualities. Such bodhisattvas should therefore be open with their possessions and strive to cultivate wisdom.

source: ཡོ་བྱད་ཐམས་ཅད་དང་། གདིང་བ་ཐམས་ཅད་དང་། མང་དུ་ཐོས་པར་བྱ་བ་དང་། སྐྱོན་དང་། ལུས་དང་། སྲོག་དང་། དགེ་བའི་རྩ་བ་དག་ལ་ཡང་མངོན་པར་བརྟག་པར་བྱའོ། །
en: They should examine all their possessions, everything upon which they sit, their body of learning, and their faults, physical body, life, and virtuous roots.

source: གང་གིས་གོས་དཀར་པོ་གཙང་མ་རྙིང་པ་གྱོན་པར་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་རོ། །
en: “If those bodhisattvas see themselves wearing clean white clothes that are old, they are on the first bhūmi.

source: གང་གིས་སར་པ་ཁ་ཚར་མེད་པ་གྱོན་པར་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they see themselves wearing new clothes without fringes, they are on the second bhūmi.

source: གང་གིས་ཁ་ཚར་ཅན་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If there are fringes, they are on the third bhūmi.

source: གང་གིས་བྱི་དོར་བྱས་པ་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If the clothes have been cleaned, they are on the fourth bhūmi.

source: གང་གིས་བཀྲུས་ཤིང་བཅགས་པ་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If the clothes have been washed and beaten, they are on the fifth bhūmi.

source: གོས་རིན་པོ་ཆེས་ནི་ས་དྲུག་པར་རོ། །
en: If the clothes are valuable, they are on the sixth bhūmi.

source: ངང་རིས་ཅན་གྱིས་ནི་ས་བདུན་པར་རོ། །
en: If the clothes have a stitched pattern, they are on the seventh bhūmi.

source: ལྷའི་གོས་ཀྱིས་ནི་ས་བརྒྱད་པར་རོ། །
en: If they are divine clothes, they are on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གི་མགོ་ལ་རིན་པོ་ཆེའི་ཕྲེང་བ་འམ། རྒྱན་གྱི་ཕྲེང་བ་ཐོགས་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དགུ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 84. “Vajrapramardin, if in a dream bodhisattvas perceive that they have a garland of jewels or a garland of ornaments on their head, consider those bodhisattvas to be on one of the first nine bhūmis.

source: དེ་ལ་བདུད་ཀྱི་ལས་ཀྱང་མེད། ལས་ཀྱི་སྒྲིབ་པ་ཡང་མེད་ན་རང་གི་ཉེས་པས་ངེས་པར་མི་འབྱུང་བས་དེས་ཐོས་པ་ཡོངས་སུ་བཙལ་བར་བྱ་ཞིང་ཆོས་ཀྱང་བསྒོམ་པར་བྱ། ཐབ་མོ་མེད་པ་དང་རྩོད་པ་མེད་པར་ཡང་བྱའོ། །
en: Since they are neither afflicted by the actions of Māra nor have karmic obscurations, it is due to their own faults that they do not find release. Such bodhisattvas should therefore seek out learning and cultivate the Dharma. They should not quarrel or argue.

source: རིན་པོ་ཆེ་སྣ་གཅིག་གི་ཕྲེང་བས་ནི་ས་དང་པོར་རོ། །
en: “If the garland consists of one kind of jewel, those bodhisattvas are on the first bhūmi.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ནི་ས་བདུན་པའི་བར་དུའོ། །
en: If it consists of seven kinds of jewels, they are on the seventh bhūmi.

source: འཁོར་ལོས་སྒྱུར་བའི་ནོར་བུ་རིན་པོ་ཆེས་ནི་ས་བརྒྱད་པར་རོ། །
en: If it consists of the precious jewels of a cakravartin, they are on the eighth bhūmi.

source: ལྷའི་ནོར་བུ་རིན་པོ་ཆེས་ནི་ས་དགུ་པར་ཏེ།
en: If it consists of divine jewels, they are on the ninth bhūmi.

source: ལས་དང་པོ་པས་མཚན་མ་དེ་དག་མཐོང་ན་འཕྱར་བར་འགྱུར་ཞིང་ལེ་ལོ་སྐྱེ་བར་ཡང་འགྱུར།
en: If novice bodhisattvas see these signs, they will become haughty, develop laziness, be overconfident, and hold others in contempt.

source: བག་འབེབས་པར་ཡང་བྱེད། གཞན་ལ་བརྙས་པར་ཡང་བྱེད་པས་དེའི་ཕྱིར་དེས་བདུད་ཀྱི་ལས་ནི་རྟོགས་པར་བྱའོ། །
en: They should therefore realize that these are the activity of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གི་མགོ་ལ་མེ་ཏོག་གི་ཕྲེང་བ་ཐོགས་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 85. “Vajrapramardin, if in a dream bodhisattvas perceive that they are wearing a garland of flowers on their head, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ནི་མེད་ལ་བདུད་ཀྱི་ལས་ནི་ཡོད་དོ། །
en: They do not have any karmic obscurations but are affected by the activity of Māra.

source: དེས་གལ་ཏེ་དང་པོ་དང་། དབུས་དང་ཐ་མར་ངེས་པར་རྟོགས་ནས་དད་པར་བྱས་ཤིང་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བས་སྐྱོ་བ་མེད་པར་བྱས་ནས།
en: Once they have realized the beginning, middle, and end, those bodhisattvas will have faith and give away all they have without remorse.

source: དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their related obscurations will be purified and they will find release in liberation.

source: མེ་ཏོག་སྣ་གཅིག་གི་ཕྲེང་བས་ནི་ས་དང་པོར་རོ། །
en: “A garland consisting of one kind of flower indicates the first bhūmi.

source: མེ་ཏོག་སྣ་གཉིས་ཀྱི་ཕྲེང་བས་ནི་ས་གཉིས་པར་རོ། །
en: A garland consisting of two kinds of flowers indicates the second bhūmi.

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཕྲེང་བས་ནི་ས་གསུམ་པར་རོ། །
en: A garland consisting of various kinds of flowers indicates the third bhūmi.

source: མེ་ཏོག་ཐམས་ཅད་ཀྱི་འཕྲེང་བ་ས་ནི་ས་བཞི་པར་རོ། །
en: A garland consisting of every kind of flower indicates the fourth bhūmi.

source: ཀླུའི་མེ་ཏོག་གི་ཕྲེང་བས་ནི་ས་ལྔ་པར་རོ། །
en: A garland consisting of nāga flowers indicates the fifth bhūmi.

source: ལྷའི་མེ་ཏོག་གི་ཕྲེང་བས་ནི་ས་དྲུག་པར་རོ། །
en: A garland consisting of divine flowers indicates the sixth bhūmi.

source: ལྷའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཕྲེང་བས་ནི་ས་བདུན་པར་རོ། །
en: A garland of various divine flowers indicates the seventh bhūmi.

source: ལྷ་དང་མིའི་མེ་ཏོག་གི་ཕྲེང་བ་འོད་འབྱུང་བས་ནི་ས་བརྒྱད་པར་རོ། །
en: A radiant garland consisting of flowers from the divine and human realm indicates the eighth bhūmi. 86.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མེ་ཏོག་སིལ་མ་དག་སྲེལ་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves holding flower petals, consider those bodhisattvas to be on one of the first seven bhūmis.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའ་དག་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱའོ། །
en: They should encourage other bodhisattvas.

source: གང་ཟག་དེ་ནི་གཡོག་འཁོར་མང་བ་དང་། རྐྱེན་མང་བ་ཡིན་ཏེ།
en: Those individuals have many servants and followers, and possess favorable circumstances.
